Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The .WHAT method returns the type object associated with the object $o, which tells the exact type of $o: in this case Programmer.
ja: .WHATメソッドはオブジェクト$oと結びつけられる型オブジェクトを返します。そして、それは$oの正確な型を教えます：この場合はProgrammerです。

source: The .WHICH Method for Value Types
ja: 値型のための.WHICHメソッド

source: The .fmt method
ja: .fmtメソッド

source: The .handled method is rw, so you may mark an exception as handled by assigning True to it.
ja: .handledメソッドはrwなので、Trueを割り当てることで例外がハンドルされたとマークすることもできる。

source: The .parse method of a grammar returns a Match object through which you can access all the relevant information of the match.
ja: グラマーの.parseメソッドは、あなたがマッチのすべての関係情報にアクセスすることができるMatchオブジェクトを返します。

source: The .sort method in lists can take a block or function that takes two values, compares them, and returns a value less than, equal to or, greater than 0.
ja: リストの中の.sortメソッドは2つの値をとるブロックか関数（それらを比較し、 より低いか、等しいか、より大きいか返す）を受け取ります。

source: The :ignorecase or :i modifier makes the regex insensitive to upper and lower case, so m/ :i perl / matches perl, PerL, and PERL (though who names a programming language in all uppercase letters?)
ja: :ignorecaseまたは:i修飾子は正規表現を大文字・小文字に無関心にするので、m/ :i perl /はperl、PerLとPERL（しかし、誰がすべて大文字でプログラミング言語に名前をつけますか？）にマッチします。

source: The :ratchet modifier disables backtracking for a whole regex, which is often desirable in a small regex called often from other regexes.
ja: :ratchet修飾子は全部の正規表現のためにバックトラックを無効にします。そして、それは他の正規表現から呼ばれる小さな正規表現でしばしば望ましいです。

source: The = operator is the assignment operator--it takes the values from the right-hand side, and stores them in the variable on the left-hand side, here @scores.
ja: =演算子は割り当て演算子です ― それは右側から値を受け取り、左側にある変数に格納します。ここでは@scoresです。

source: The => operator (the fat arrow) constructs Pair objects.
ja: =>演算子（太い矢）はPairオブジェクトを構築します。

source: The Cool module also contains all multisubs of last resort; these are automatically searched if normal multiple dispatch does not find a viable candidate.
ja: Coolモジュールは最後の手段の全てのマルチサブを含みます；通常のマルチディスパッチが可能な候補を見つけなければ、それらは自動的に検索されます。

source: The Cool type is derived from Any, and contains all the methods that are "cool" (as in, "I'm cool with an argument of that type.").
ja: Cool型はAnyから派生し、“cool”（“私はその型の引数にクールです”）なメソッドを全て含みます。

source: The Int type object both conforms to Int, but it is also an undefined value.
ja: Int型オブジェクトはIntに両方とも従います、しかし、それは未定義値でもあります。

source: The MAIN Subroutine
ja: MAINサブルーチン

source: The Plugins role is at the heart of this.
ja: Pluginsロールはこれの中心にあります。

source: The Str candidate does more work: it wraps its parameter in quotes and escapes literal characters that the JSON spec does not allow in strings--a tab character becomes "\t", a newline "\n", and so on.
ja: Str候補はもっと多くの仕事をします；それはパラメータをクオートし、JSONの仕様で許可されないリテラル文字をエスケープします ― タブ文字は"\t"、改行は"\n"などです。

source: The StrPos Type
ja: StrPos型

source: The TOP rule has an alternation with two branches, object and array.
ja: TOPルールはobjectとarrayという2つの分岐を持っています。

source: The [] declares an empty nested signature for the first positional parameter.
ja: []は、最初のポジションのパラメータのために空の入れ子になったシグネチャーを宣言します。

source: The also declarator is primarily intended for roles but can also be useful when creating anonymous classes or roles:
ja: also宣言子は主にロールを目的としますが、匿名のクラスまたはロールを作る場合にも有用です：

source: The anon declarator allows a declaration to provide a name that can be used in error messages, but that isn't put into any external symbol table:
ja: anon宣言はエラーメッセージに使用できる名前を提供するための宣言を可能にしますが、それはどの外部のシンボルテーブルにも置かれません：

source: The but operator
ja: but演算子

source: The callsame primitive calls the next candidate, passing along the arguments received.
ja: 最初のcallsameは次の候補を呼びます。そして引数に沿ったパスが受け取られます。

source: The caps method returns all captures, named and positional, in the order in which their matched text appears in the source string.
ja: capsメソッドはすべてのキャプチャー（名前付きの、位置依存の）をそれらのマッチしたテキストがソース文字列で出現する順序で返します。

source: The eqv operator returns True only if two objects are of the same type and the same structure.
ja: eqv演算子はオブジェクトが同じ型で同じ構造の場合だけTrueを返します。

source: The fail function responds to the caller's use fatal state.
ja: fail関数は呼び出し元のuse fatal状態に応答する。

source: The for statement
ja: for文

source: The gather statement prefix
ja: gather文プレフィックス

source: The if and unless statements work much as they do in Perl 5.
ja: if文とunless文はPerl 5のように動作する。

source: The index method searches a string for another substring and returns the position of the search string.
ja: indexメソッドは文字列を別の部分文字列で検索して、検索文字列の位置を返します。

source: The is rw trait causes the generated accessor method to return something external code can modify to change the value of the attribute.
ja: is rwトレイトは発生するアクセッサ・メソッドにコードが属性の値を変えるために修正することができる外部の何かを返させます。

source: The lift statement prefix
ja: lift文接頭辞

source: The loop statement is the C-style for loop in disguise:
ja: loop文はC言語スタイルのforループを装う：

source: The make explanation is fuzzy.
ja: makeの説明はあいまいです。

source: The of type specifies what kinds of values may be stored in the variable.
ja: of型はどのような種類の値が変数に保存されるか指定します。

source: The orig method returns the string that was matched against.
ja: origメソッドはマッチした文字列を返します。

source: The pairlist rule matches multiple comma-separated pairs.
ja: pairlistルールはコンマで区切られた複数のペアにマッチします。

source: The perform method will never terminate because the first thing the method does is to call all the perform methods of its dependencies.
ja: メソッドがする最初のものがすべての従属物のperformメソッドを呼ぶことであるので、performメソッドは決して終わらないでしょう。

source: The process methods of the roles AnswerToAll and AnswerIfTalkedTo use a modified syntax for calling methods:
ja: ロールAnswerToAllとAnswerIfTalkedToのprocessメソッドは、メソッドを呼ぶために変更された構文を使います：

source: The proto token syntax indicates that value will be a set of alternatives instead of a single regex.
ja: proto token構文は、valueが一つの正規表現の代わりに選択肢のセットであることを示します。

source: The regex { :ratchet ... } pattern is so common that it has its own shortcut: token { ... }.
ja: regex { :ratchet ... }パターンは一般的なので、それ自身のショートカットを持っています：token { ... }です。

source: The repeat statement
ja: repeat文

source: The returns declarations is an alias for the of type of a subroutine.
ja: returns宣言はサブルーチンのof型の別名です。

source: The sink statement prefix will eagerly evaluate any block or statement, throw away the results, and instead return the empty Parcel value, ().
ja: sinkステートメントプレフィックスは何らかのブロックまたはステートメントを評価して結果を捨て、その代わりに空のParcel値、()を返します。

source: The subst method matches a regex against a string.
ja: substメソッドは、文字列に対して正規表現をマッチさせます。

source: The take function essentially has two contexts simultaneously, the context in which the gather is operating, and the context in which the take is operating.
ja: take関数は本質的に同時に二つのコンテキストを持つ。gatherが動作中のコンテキスト、takeが動作中のコンテキスト。

source: The take function is lexotic if there is a visible outer gather, but falls back to purely dynamic if not.
ja: take関数は、可視の外側のgatherがあるならレギゾチックだ。 しかしそうでないなら純粋なダイナミックに戻る。

source: The take operation may be defined internally using resumable control exceptions, or dynamic variables, or pigeons carrying clay tablets.
ja: takeの動作は再動作可能な制御例外、または動的変数、または粘土板を運ぶハトを使って内部的に定義されているだろう。

source: The to-json(Array $d) candidate converts all elements of the array to JSON with recursive calls to to-json, joins them with commas, and surrounds them with square brackets.
ja: to-json(Array $d)候補は配列のすべての要素をto-jsonの再帰呼び出しによって変換します。それらをコンマでつなぎ、スクエアブラケットで囲みます。

source: The unless statement does not allow an elsif or else in Perl 6.
ja: Perl 6ではunless文はelsifまたはelseを許可しない。

source: The while and until statements
ja: whileとuntil文

source: The while and until statements work as in Perl 5, except that you may leave out the parentheses around the conditional:
ja: whileとuntil文はPerl 5のように動作する。条件文の周囲の括弧を省略するかもしれない場合を除いて：

source: The en literal can now match the last two characters of the string, and the overall match succeeds.
ja: リテラルのenは現在文字列の最後の2つの文字にマッチすることができます。そして全体のマッチは成功します。

source: The ! character is a twigil, or secondary sigil.
ja: !文字はtwigil、または第2のシギルです。

source: The :g modifier tells the substitution to work globally to replace every possible match.
ja: :g修飾子は、すべての可能なマッチを置き換えるためにグローバルに動作するよう置換に命じます。

source: The @ sigil marks the declared variable as an Array.
ja: @シギルは宣言された変数がArray（配列）であることを表します。

source: The Bool candidate returns a literal string 'true' or 'false'.
ja: Bool候補はリテラル文字列'true'または'false'を返します。

source: The Buf type is available for storing binary data.
ja: Buf型は、バイナリデータの格納に利用できます。

source: The callwith primitive calls the next candidate with different (and provided) arguments.
ja: 最初のcallwithは異なる（そして、提供される）引数で、次の候補を呼びます。

source: The from and to methods return the positions of the start and end points of the match.
ja: fromとtoメソッドは、マッチの始まりと終点の位置を返します。

source: The given block is just one way to set the current topic, but a switch statement can be any block that sets $_, including a for loop (assuming one of its loop variables is bound to $_) or the body of a method (if you have declared the invocant as $_).
ja: givenブロックは現在のトピックをセットする一つの方法だ。しかしswitch文は$_をセットするどんなブロックにもなれる。forループ（ループ変数の一つが$_にバインドされていると仮定する）またはメソッドの本体（もしインボカントを$_として宣言しているなら）を含む。

source: The rindex method does the same, but searches backwards from the end of the string, so it finds the position of the final occurrence of the substring.
ja: rindexメソッドは同じようにしますが、文字列の終わりから後方に検索するので、それは部分文字列の最終的な発生位置を見つけます。

source: The ! prefix negates the boolean value.
ja: !接頭辞はブール値を反転します。

source: The $ sigil, however, indicates a general container that can hold anything and be accessed in any manner.
ja: $シギルは何でも保持することができて、どんな方法でもアクセスができる全般的なコンテナーを示します。

source: The :local named argument limits the returned methods to those defined in the Employee class, and excludes the inherited methods.
ja: :localという名前付き引数はEmployeeクラスに定義されているメソッドに限定し、継承したメソッドを除いて返します。

source: The <name=&regex> syntax creates a capture named name, which records what &regex matched in the match object.
ja: <name=&regex>構文はキャプチャー名をつけられたnameを作ります。そして、それは&regexが何をマッチしたのかをマッチオブジェクトにを記録します。

source: The Grammar base grammar contains broadly useful rules predefined.
ja: Grammarベース文法は、あらかじめ定義された広く役立つルールを含みます。

source: The bless method expects a positional parameter--the so-called "candidate"--and a set of named parameters providing the initial values for each attribute.
ja: blessメソッドは位置依存パラメータを期待します ― いわゆる「候補」 ― そしてそれぞれの属性のための初期値を提供する名前付きパラメータのセット。

source: The encode method converts a Str to Buf.
ja: encodeメソッドは、StrをBufに変えます。

source: The sort method's argument is a block used to transform the array elements (the names of players) to the data by which to sort.
ja: sortメソッドの引数は配列要素（プレイヤーの名前）をソートするデータに変えるのに使われるブロックです。

source: The Nil value represents the absence of a value where there should be one, so it does not disappear in list context, but relies on something downstream to catch it or blow up.
ja: Nil値はあるべきである値の欠如を表すので、リストコンテキストで消えません。しかしそれを捕らえるかブローアップする下流の何かに頼ります。

source: The \w control sequence stands for a "Word" character--a letter, digit, or an underscore.
ja: \w制御シーケンスは、ワード文字 ― 文字、数字またはアンダーライン ― を表します。

source: The does operator adds this role to $self--not the class of $self, but the instance itself.
ja: does演算子は、$self ― $selfのクラスでなく、インスタンス自体に ― このロールを追加します。

source: The get method reads and returns one line from the file, removing the line ending.
ja: getメソッドはファイルから1行を読み込んで返します。そして行末は取り除きます。

source: The & sigil requires the caller to pass an object that does the Callable role such as an anonymous subroutine.
ja: &シギルは無名サブルーチンのようなCallableロールをするオブジェクトを渡すことを呼び出し元に要求します。

source: The .next and .last methods take an optional argument giving the final value of that loop iteration.
ja: .nextと.lastメソッドはそのループのイテレーションの最終値を与える任意の引数をとる。

source: The take function's signature is like that of return; while having the syntax of a list operator, it merely returns a single item or "argument" (see S02 for definition).
ja: take関数のシグネチャーはreturnのようなものだ；リスト演算子の文法を持ち、単独のアイテムか引数をただ返すだけだ（定義はS02を参照）。

source: The nominal type is an actual type name, here Numeric, as opposed to a type plus additional constraints, which are discussed in the next section.
ja: 名目の型は実際の型名、ここではNumeric、型に加えて更なる制約は次のセクションで論じます。

source: The postcircumfix operator {...} occurs after (post) a term, and consists of two symbols (an opening and a closing curly bracket) which enclose (circumfix) another term.
ja: 後置接周辞演算子{...}は項の後（post）で起こり、他の項を囲む（接周辞）2つのシンボル（開始と終わりのカーリーブラケット）から成ります。

source: The signature of a subroutine is a description of any arguments it takes and any return values it produces.
ja: サブルーチンのシグネチャーは受け取る引数、生成する返り値の説明です。

source: The ASCII art dancing example from earlier in this chapter is simpler when each subroutine returns a new string:
ja: この章の以前のアスキーアートダンスの例はそれぞれのサブルーチンが新しい文字列を返す場合により簡単になります：

source: The Basics
ja: 基本

source: The Cool class (and package)
ja: Coolクラス（とパッケージ）

source: The Perl 6 equivalent to Perl 5's eval {...} is try {...}.
ja: Perl 5のeval {...}に対するPerl 6の同等物はtry {...}だ。

source: The Relationship of Blocks and Declarations
ja: ブロックと宣言の関係

source: The Relationship of Blocks and Statements
ja: ブロックと文の関係

source: The action method takes the AST attached to the match object of that sub capture, and promotes it as its own AST by calling make.
ja: アクションメソッドはサブキャプチャーのマッチオブジェクトに付属のASTを受け取り、makeを呼ぶことで自身のASTに昇格させます。

source: The action methods for proto tokens include the full name of each individual rule, including the sym part:
ja: プロトトークンのためのアクションメソッドは、個々のルール（symの部分を含む）のフルネームを含みます：

source: The addition and incrementing operators treat Any as a number with the value of zero; the strings get automatically converted to numbers, as addition is a numeric operation.
ja: 加算とインクリメント演算子はAnyをゼロの値の数とみなします；文字列は自動的に数値に変わり、加算は数値演算になります。

source: The appropriate regex for that is m/pe \w l/.
ja: それのための適切な正規表現はm/pe \w l/です。

source: The array items are passed in through the topic variable $_.
ja: 配列のアイテムはトピック変数$_を通して渡されます。

source: The asterisk * stands for zero or more occurrences, so m/z\w*o/ can match zo, zoo, zero and so on.
ja: アスタリスク*は0以上の発生を表すので、zoはzo、zoo、zeroなどにマッチすることができます。

source: The atom on the left of the tilde (A) is matched normally, but the atom to the right of the tilde (B) is set as the goal, and then the final atom (C) is matched.
ja: チルダの左のアトム（A）は普通にマッチされます。しかしチルダの右のアトム（B）は最終目的としてのセットです。そして、最後のアトム（C）がマッチされます。

source: The base case is that of the empty list, which trivially sorts to the empty list.
ja: ベースケースはその空のリストです。それは空のリストをつまらなくソートします。

source: The benefit of using this over a signature like :(*@pos, *%named) is that these both enforce some context on the arguments, which may be premature.
ja: :(*@pos, *%named)のようなシグネチャーを使う利点は、未熟かもしれない引数をいくつかのコンテキストに強制することです。

source: The biggest difference between constructors in Perl 6 and constructors in languages such as C# and Java is that rather than setting up state on a somehow already magically created object, Perl 6 constructors actually create the object themselves.
ja: Perl 6とC#やJavaのような言語との間の大きな違いは、何故かすでにマジカルに作成されたオブジェクトの状態をセットするよりも、Perl 6は実際にそれら自身でオブジェクトを作成することです。

source: The block after the where is optional; Perl performs the check by smart matching the argument against whatever follows the where.
ja: whereの後のブロックは任意です；Perlはwhereに続く引数ならなんでもスマートマッチングでチェックを実行します。

source: The block that follows may contain arbitrary code, just as with any other block, but classes commonly contain state and behavior declarations.
ja: 続くブロックは何か他のブロックのように不定のコードを含みます。しかしクラスは一般に状態と振る舞いの宣言を含みます。

source: The body is empty; the class defines no attributes or methods of its own.
ja: 本体は空です；クラスは独自の属性またはメソッドを定義しません。

source: The body of such an alternative is a normal regex, where the call <sym> matches the value of the parameter, in this example thing.
ja: そのような選択肢のボディは通常の正規表現です。そこで、呼び出し<sym>はパラメータの値にマッチします（この例ではthing）。

source: The body of the subroutine follows as a block of code enclosed in curly braces.
ja: サブルーチンの本体は、ブレースに入れられるコードのブロックとして後に続きます。

source: The body of this function complains that it doesn't know what to do with the argument.
ja: この関数の本体は、それが引数をどうすべきかわからないと不平を言います。

source: The brackets in the signature tell the compiler to expect a list-like argument.
ja: シグネチャーのブラケットは、リストのような引数を予想するようコンパイラに命じます。

source: The built-in function open opens a file, here named scores, and returns a file handle--an object representing that file.
ja: 組み込み関数openは、ここではscoresという名前のファイルを開き、そしてファイルハンドル ― そのファイルを表すオブジェクトを返します。

source: The built-in function substr can not only extract parts of strings, but also modify them:
ja: 組み込み関数substrは文字列の部分を抽出することができるだけでなく、それらを修正することもできます：

source: The built-in token <alpha> matches an alphabetic character, so you can rewrite this example as:
ja: なたがこの例を書き直すことができるように、ビルトイントークン<alpha>は英字にマッチします：

source: The candidate for handling Real is very simple; because JSON's and Perl 6's number formats coincide, the JSON converter can rely on Perl's conversion of these numbers to strings.
ja: Realを取り扱う候補はとてもシンプルです；JSONとPerl 6の数値フォーマットは一致するので、JSONコンバータはこれらの数値から文字列への変換をPerlに頼ることができます。

source: The candidate that processes hashes turns them into the form { "key1" : "value1", "key2" : [ "second", "value" ] }.
ja: ハッシュを処理する候補は{ "key1" : "value1", "key2" : [ "second", "value" ] }という形式にします。

source: The choice any particular implementation makes is specifically not part of the definition of Perl 6, and you should not rely on it in portable code.
ja: どんな特定の実装の選択も明確にPerl 6の定義の一部ではない。そして移植可能なコード内でそれに頼るべきではない。

source: The class inherits from IRCBot, using the is trait modifier--something familiar from earlier chapters--but it also uses the does trait modifier to compose two roles into the class.
ja: クラスはIRCBotから継承します。isトレイト修飾子を用いて ― 以前の章からおなじみの何か ― しかし、2つのロールをクラスに結合するためにdoesトレイト修飾子も使用します。

source: The code calls .join to turn it into a string.
ja: コードはそれを文字列に変えるために.joinを呼び出します。

source: The code creates a class for each possible symbol.
ja: コードは可能なシンボルごとにクラスを作成します。

source: The code presented here is runnable.
ja: ここで示すコードは実行可能です。

source: The compiler has to execute the where-block at least once to check if the third candidate is the best match, but the specification does not require the minimal possible number of runs.
ja: コンパイラは第3候補が最善のマッチであるかどうかこと調べるために少なくとも一回whereブロックを実行しなければなりません。しかし、仕様では実行の最小の実行可能数を要求しません。

source: The compiler is free to ignore FINAL phasers compiled at run time since they're too late for the application-wide linking decisions.
ja: コンパイラが実行時にコンパイルされたFINALを無視するのは自由だ。application-wideリンクの決定の時から遅すぎる。

source: The compiler is free to infer what type information it can from the types you supply, but it will not complain about missing type information unless you ask it to.
ja: コンパイラがあなたが供給できる型から型情報を推測するのは自由です。しかしあなたがそれを尋ねない限り、欠けている型情報について不満を言いません。

source: The construct m/ ... / builds a regex.
ja: m/ ... /は正規表現を構築します。

source: The constructor captures these into the @dependencies slurpy array and passes them as named parameters to bless (note that :&callback uses the name of the variable--minus the sigil--as the name of the parameter).
ja: コンストラクタはそれらをslurpyな配列@dependenciesにキャプチャーし、blessに名前付きパラメータとして渡します（:&callbackは変数名を使うので注意してください ― シギル無しで ― パラメータの名前として）。

source: The container object itself then becomes undefined.
ja: コンテナオブジェクト自体は未定義になります。

source: The container type specifies how the variable itself is implemented.
ja: コンテナ型は変数自体がどのように実装されるか指定します。

source: The control lambda is logically separate from the catch lambda, though an implementation is allowed to combine them if it is careful to retain separate semantics for catch and control exceptions.
ja: 制御lambdaはキャッチlambdaとは論理的に異なる。けれどもキャッチと制御例外のセマンティクスを別々に注意して保持するなら実装を結合することは許可される。

source: The curly braces for the constraint can contain arbitrary code.
ja: 制約のためのブレースは、任意のコードを含むことができます。

source: The current topic is always aliased to the special variable $_.
ja: 現在のトピックは常に特殊変数$_にエイリアスされる。

source: The declaration and intent may seem simple at first, but look closer.
ja: 宣言と意図は、最初は単純なようであるが、より間近に見ます。

source: The default case:
ja: defaultケース：

source: The default comparison is case sensitive.
ja: デフォルトの比較は大文字と小文字を区別します。

source: The definitions of alphabetic and numeric include appropriate Unicode characters.
ja: 英字と数字の定義は適切なユニコード文字も含みます。

source: The desire to allow whitespace anywhere in a string is common.
ja: 文字列のどこでも空白文字を許可したいという願望は一般的です。

source: The difference between the approaches is primarily one of clarity, as each alternative provides a different quoting mechanism.
ja: アプローチ間の違いは第一に分かりやすさで、それぞれの選択肢は異なるクオートメカニズムを提供します。

source: The discussion of slurpy versus optional parameters seems out of place here; functions chapter?
ja: 大食いな対任意のパラメータに関する議論は、ここで不適当なようです；関数の章ですか？

source: The dot (.) matches a single, arbitrary character:
ja: ドット（.）は、一つの任意の文字にマッチします：

source: The dot matched an l, r, and n, but it will also match a space in the sentence the spectroscope lacks resolution--regexes ignore word boundaries by default.
ja: ドットはl、rとnにマッチしました。しかし、それは文のthe spectroscope lacks resolutionにもマッチするでしょう ― 正規表現はデフォルトで単語境界を無視します。

source: The drawing area has the width $screen-width - $label-area-width, so for each score, it should print:
ja: 描画エリアは横幅$screen-width - $label-area-widthをそれぞれのスコアに持っているので、それは以下を出力するはずです。

source: The duplicate word search regex had to anchor the regex to word boundaries, because \w+ would allow matching only part of a word.
ja: \w+がワードの一部だけにマッチするのを許可するので、重複する文字列検索正規表現は正規表現を語境界に固定しなければなりませんでした。

source: The easiest way to restrict the possible values that a subroutine accepts is by writing a type name before a parameter.
ja: サブルーチンが受け入れ可能な値を制限する最も簡単な方法は、パラメータの前に型名を書くことです。

source: The editor in me wants to fix this example to use the serial comma.
ja: 私のエディタは、この例を修正したいです ― 連続コンマを使うために。

source: The effect of :ratchet applies only to the regex in which it appears.
ja: :ratchetの影響は、それが出現する正規表現だけに適用されます。

source: The entire type check can only succeed if the code block returns a true value.
ja: コードブロックが真の値を返す場合だけ、全ての型チェックは成功することができます。

source: The equality sign = assigns that file handle to the variable on the left, which means that $file now stores the file handle.
ja: 等号符号=は左の変数にそのファイルハンドルを割り当てます。それは現在$fileがファイルハンドルを格納していることを意味します。

source: The eventual binding context thus determines whether to throw away or keep the groupings resulting from each individual take call.
ja: 最終のバインディングコンテキストはグルーピングを捨てるか保つか決める。それぞれの個々のtake呼び出しからの結果として。

source: The example JSON grammar introduces the goal matching syntax which can be presented abstractly as: A ~ B C.
ja: 例のJSONグラマーは、最終目的のマッチング構文を導入します。それは抽象的にはA ~ B Cと表されます。

source: The example above uses the class name Task so that other code can refer to it later, such as to create class instances by calling the new method.
ja: 他のコードが後でそれを参照することができるように、上の例はクラス名Taskを使います、例えばnewメソッドを呼ぶことによってクラスインスタンスを作るために。

source: The example below demonstrates the Baker class overriding the Cook's cook method.
ja: 下の例はCookクラスのcookメソッドをオーバーライドするBakerクラスを示します。

source: The example code includes attributes (state), introduced through the has keyword, and behaviors introduced through the method keyword.
ja: 例のコードは属性（状態）を含み、hasキーワードで導入されます。そして振る舞いはmethodキーワードです。

source: The example in this chapter uses this to give bots new abilities during their lifetimes.
ja: この章の例は、それらのライフタイムの間、ボットに新しい機能を与えるためにこれを使います。

source: The example's constructor turns positional arguments into named arguments, so that the class can provide a nice constructor for its users.
ja: 例のコンストラクタは位置依存パラメータを名前付きパラメータに変換します。なのでクラスはユーザーに良いコンストラクタを提供できます。

source: The exception thrower looks up the call stack for a catch lambda that returns () to indicate all exceptions are handled, and then it is happy, and unwinds the stack to that point.
ja: 例外を投げるものは全ての例外がハンドルされることを示すために()を返すlambdaをキャッチするためにコールスタックを探す。そしてそのときハッピーで、その点にスタックを巻き戻す。

source: The explanations of this example have one implication which is not entirely obvious.
ja: この例の説明には、完全に明らかであるというわけではない1つの含みがあります。
